/*/

%item cookingRecipe %%
 	Teach the player the cooking recipe whose requirement field starts with f <npc name>, where <npc name> is the mail key with 'Cooking' removed. For example, if the mail key is RobinCooking, this command would find a cooking recipe with a requirement starting with f Robin that the player doesn't already know. 

%item conversationTopic <key> <days> %%
    Start an active dialogue event for the given number of days. 
    https://stardewcommunitywiki.com/Modding:Dialogue#Active_dialogue_events

%item object [<id> <count>]+ %%
    Attach a random item from the listed space-delimited item IDs and counts. For example, %item object 388 50 %% attaches 50 wood; %item object 388 50 390 10 %% attaches either 50 wood, or 10 stone. See Modding:Object data for a list of item IDs. 
    https://stardewcommunitywiki.com/Modding:Object_data

1.6 %item <item id> [count]
    Added %item id <item id> [count] form which accepts a qualified or unqualified item ID. This deprecates the bigobject, furniture, object, and tools options.

    Added optional <key> argument to %item cookingRecipe <key>, to learn a specific cooking recipe. The previous %item cookingRecipe form (without a key) works the same way as before.

    Fixed %item craftingRecipe not supporting recipe IDs containing underscores. It now checks for an exact match first, then tries replacing underscores with spaces like before, then logs a warning if neither was found instead of adding an invalid recipe.
    
    https://stardewvalleywiki.com/Modding:Migrate_to_Stardew_Valley_1.6#Custom_items
    https://stardewvalleywiki.com/Modding:Recipe_data

PLAYER_HAS_COOKING_RECIPE <player> <recipe name>
    Whether the specified player(s) know the crafting/cooking recipe identified by its internal name (spaces allowed). For example, PLAYER_HAS_CRAFTING_RECIPE Current Field Snack. 
/*/

/*/

-Recipe Ideas-

The Southern Suite

Fried Catfish
Ingredients 
Catfish
Corn
Flour
Oil (maybe?)
Milk

Coleslaw
Cabbage
Cave Carrot
Mayonnaise
Sugar

Hush Puppies
Corn
Oil
Flour
Spring Onion

Cornbread
Corn
Flour
Milk
Sugar

Biscuits
Flour
Sugar
Egg 
Milk

Biscuits & Gravy
Biscuit
Milk
Common Mushroom

Biscuits & Jam
Biscuit 
Jelly

Chicken Fried Steak
Common Mushroom
Flour
Oil
Milk



/*/


{
    "Action": "EditData",
    "Target": "Data/mail",
    "Entries": {


    /*/----------Recipes----------/*/
    
    //"Mail.Title": "Dear @, ^^ Line.  ^Another line. ^   Sincerely, Antoine %item cookingRecipe %% [#]Title",
    

    /*/----------Gifts----------/*/
    
    //"Mail.Title": "Dear @, ^^ Line.  ^Another line. ^   Sincerely, Antoine % %item <item id> [count] %% [#]Title",


    /*/----------Fun----------/*/
    
    //"Mail.Title": "Dear @, ^^ Line.  ^Another line. ^   Sincerely, Antoine [#]Title",


    /*/----------Event Specific----------/*/

    //"Mail.Title": "Dear @, ^^ Line.  ^Another line. ^   Sincerely, Antoine [#]Title",


    /*/----------Recipe Sharing Letters----------/*/

    //Conditions: Player agreed to share recipes. (Note: No other letters should trigger until this one does.) Not winter.
    "Mail.RecipeAdventure": "Dear @, ^^ Thanks so much for agreeing to swap recipes with me. I haven't gotten to read the ones you've sent my way just yet, but I definitely plan to as soon as I have the free time! ^ Until then, I just wanted to send you this as thanks. Also to test how well food ships in the mail. Let me know if it's all cold or smooshed!^ Sincerely, Antoine %item 194 1 %% [#]The beginning of our cooking adventure!",

    //Conditions: Has Cooking Recipe - Omelet, Not Winter
    "Mail.RecipeOmelet": "Dear @, ^^ I just watched the best show called the Queen of the Sauce! I really enjoyed trying her omelet technique! ^I noticed that it was really similar to the omelet recipe you sent me. Are you a fan of hers too? ^   Sincerely, Antoine %item 195 1 %% [#]Omelet",

    //Conditions: Has Cooking Recipe - Parsnip Soup, Not Winter
    "Mail.RecipeParsnipSoup": "Dear @, ^^ Caroline's parsnip soup is just the best. She really puts a lot of love in it. ^ And by love I mean salt, ha ha. I didn't use quite as much. ^   Sincerely, Antoine %item 195 1 %% [#]Parsnip Soup",

    //Conditions: Has Cooking Recipe - Vegetable Medley, Not Winter
    "Mail.RecipeVegetableMedley": "Dear @, ^^ I'm in love with the vegetable combination that Caroline puts in her vegetable medley! I had to make extra just to have some again later. ^   Sincerely, Antoine %item 195 1 %% [#]Vegetable Medley",

    //Conditions: Has Cooking Recipe - Algae Soup, Not Winter
    "Mail.RecipeAlgaeSoup": "Dear @, ^^ You know, some people really get put off by algae's odd texture. I really like it though, and Clint was really clever with it. ^   Sincerely, Antoine %item 195 1 %% [#]Algae Soup",

    //Conditions: Has Cooking Recipe - Bean Hotpot, Not Winter
    "Mail.RecipeBeanHotpot": "Dear @, ^^ Something about Clint's bean hotpot really draws you in. I got a lot of extra energy after trying it too. ^ Who would have thought Clint would have it in him, huh? ^   Sincerely, Antoine %item 195 1 %% [#]Bean Hotpot",

    //Conditions: Has Cooking Recipe - Roots Platter, Not Winter
    "Mail.RecipeRootsPlatter": "Dear @, ^^ I guess spending so much time in the mines really gave you some inspiration. ^ It was super tasty, and I'm definitely going to make some again later! ^  Sincerely, Antoine %item 195 1 %% [#]Roots Platter",

    //Conditions: Has Cooking Recipe - Squid Ink Ravioli, Not Winter
    "Mail.RecipeSquidInkRavioli": "Dear @, ^^ This is such a clever use of squid ink! But I didn't have any from squid so I just used regular ink. ^ Ha ha, just kidding. I wish I could have seen your face. ^  Sincerely, Antoine %item 195 1 %% [#]Squid Ink Ravioli",

    //Conditions: Has Cooking Recipe - Fried Mushroom, Not Winter
    "Mail.RecipeFriedMushroom": "Dear @, ^^ Demetrius' fried mushrooms are so tasty. I never would have thought to cook them this way! ^ I managed to pick the mushrooms super fresh too. ^  Sincerely, Antoine %item 195 1 %% [#]Fried Mushroom",

    //Conditions: Has Cooking Recipe - Autumn's Bounty, Not Winter
    "Mail.RecipeAutumnsBounty": "Dear @, ^^ YAMS! I used so many of them in my version of this dish! Demetrius really knows his stuff. ^ Don't worry, there isn't nearly as much yam in yours, ha ha. ^  Sincerely, Antoine %item 195 1 %% [#]Autumn's Bounty",

    //Conditions: Has Cooking Recipe - Ginger Ale, Not Winter
    "Mail.RecipeGingerAle": "Dear @, ^^ Wow, a dwarf recipe. This must be pretty special. It tastes good too. ^ What do you mean it cost you 1,000g?! ^  Sincerely, Antoine %item 195 1 %% [#]Ginger Ale",

    //Conditions: Has Cooking Recipe - Salad, Not Winter
    "Mail.RecipeSalad": "Dear @, ^^ Ah, Emily said she sent you her salad recipe. I'm a big fan of it too. Ha ha, no surprise there, huh? ^ I tried a different dressing than what she tends to use. ^  Sincerely, Antoine %item 195 1 %% [#]Salad",

    //Conditions: Has Cooking Recipe - Red Plate, Not Winter
    "Mail.RedPlate": "Dear @, ^^ This dish is pretty good for you. Just, uh, don't eat too much of it all at once. ^ Everyone digests things … a little different. ^  Sincerely, Antoine %item 195 1 %% [#]Red Plate",

    //Conditions: Has Cooking Recipe - Cookie, Not Winter
    "Mail.Cookie": "Dear @, ^^ Evelyn gave you her cookie recipe?! They so good! ^ I've sort of been eating them non-stop. I managed to save you these though. ^  Sincerely, Antoine %item 195 1 %% [#]Cookie",

    //Conditions: Has Cooking Recipe - Rice Pudding, Not Winter
    "Mail.RicePudding": "Dear @, ^^ I'm not so sure how I feel about the sweetness of this one. Maybe I didn't follow the recipe right? ^ At least it's fun to eat though. ^  Sincerely, Antoine %item 195 1 %% [#]Rice Pudding",

    //Conditions: Has Cooking Recipe - Farmer's Lunch, Not Winter
    "Mail.FarmersLunch": "Dear @, ^^ Any good farmer needs a good farmer's lunch. This is such a clever way of jazzing up an omelet. ^ The Queen would be proud! ^  Sincerely, Antoine %item 195 1 %% [#]Farmer's Lunch",

    //Conditions: Has Cooking Recipe - Seafoam Pudding, Not Winter
    "Mail.SeafoamPudding": "Dear @, ^^ Well this one was certainly interesting. I guess when you're out at sea you really have to work with what you've got. ^ Sorry if this one is a bit … thick. ^  Sincerely, Antoine %item 195 1 %% [#]Seafoam Pudding",

    //Conditions: Has Cooking Recipe - Dish O' The Sea, Not Winter
    "Mail.DishOTheSea": "Dear @, ^^ Fish and hashbrowns were not a combination I'd considered before, but it really works! ^ I'm not sure how you're supposed to keep it from getting soggy though. ^  Sincerely, Antoine %item 195 1 %% [#]Dish O' The Sea",

    //Conditions: Has Cooking Recipe - Survival Burger, Not Winter
    "Mail.SurvivalBurger": "Dear @, ^^ Ha ha, I'm not sure I could call this one a burger, but it's definitely a tasty sandwich! ^ I can see how it might want you to go out and find more to eat though. ^  Sincerely, Antoine %item 195 1 %% [#]Survival Burger",

    //Conditions: Has Cooking Recipe - Fried Eel, Not Winter
    "Mail.FriedEel": "Dear @, ^^ Evelyn isn't the only chef in the family! This fried eel was a little bit greasy but great! ^ I tried to soak some of the extra grease off with a paper towel. ^  Sincerely, Antoine %item 195 1 %% [#]Fried Eel",

    //Conditions: Has Cooking Recipe - Spicy Eel, Not Winter
    "Mail.SpicyEel": "Dear @, ^^ This one has some kick to it! It really puts a fire in your belly. ^ Just be careful not to get too much fire down there. It has to come out sometime. ^  Sincerely, Antoine %item 195 1 %% [#]Spicy Eel",

    //Conditions: Has Cooking Recipe - Tropical Curry, Not Winter
    "Mail.TropicalCurry": "Dear @, ^^ The pineapple bowl is such an interesting touch, but I'm not sure how it really enhances the curry. ^ Hot pepper and coconut are also a bit … I'm sorry you paid how much for this? ^  Sincerely, Antoine %item 195 1 %% [#]Tropical Curry",

    //Conditions: Has Cooking Recipe - Salmon Dinner, Not Winter
    "Mail.SalmonDinner": "Dear @, ^^ Wow, Gus definitely knows what he's doing. This was the best salmon dish I've ever made. ^ I hope you'll agree. ^  Sincerely, Antoine %item 195 1 %% [#]Salmon Dinner",

    //Conditions: Has Cooking Recipe - Cranberry Sauce, Not Winter
    "Mail.CranberrySauce": "Dear @, ^^ I guess the only way some people can eat cranberries is if you cook them with a lot of sugar. ^ I don't really mind the bitterness myself, but having it sweet is nice sometimes too. ^  Sincerely, Antoine %item 195 1 %% [#]Cranberry Sauce",

    //Conditions: Has Cooking Recipe - Triple Shot Espresso, Not Winter
    "Mail.TripleShotEspresso": "Dear @, ^^ This was so strong! I've been shaking all morning! I don't like it! ^ Here, you can just have all of it. I hope it was worth the money. ^  Sincerely, Antoine %item 195 1 %% [#]Triple Shot Espresso",

    //Conditions: Has Cooking Recipe - Banana Pudding, Not Winter
    "Mail.BananaPudding": "Dear @, ^^ You got this recipe from a mysterious bird for a bunch of bone fragments? ^ Well it's definitely tasty! So it was worth it! I added little vanilla cookies to mine. ^  Sincerely, Antoine %item 195 1 %% [#]Banana Pudding",

    //Conditions: Has Cooking Recipe - Fried Calamari, Not Winter
    "Mail.FriedCalamari": "Dear @, ^^ Jodi's fried calamari is really chewy. It's definitely a whole experience. ^ I hope it's one you enjoy. ^  Sincerely, Antoine %item 195 1 %% [#]Fried Calamari",

    //Conditions: Has Cooking Recipe - Ice Cream, Not Winter
    "Mail.IceCream": "Dear @, ^^ I've never made ice cream before, I didn't realize it was so simple! ^ It's a little cold for my liking, but on a really hot day I guess it'd be nice! ^  Sincerely, Antoine %item 195 1 %% [#]Ice Cream",

    //Conditions: Has Cooking Recipe - Crispy Bass, Not Winter
    "Mail.CrispyBass": "Dear @, ^^ Kent is full of surprises. One of them being he knows how to cook a mean bass dish. ^ I managed to get it extra crispy too. ^  Sincerely, Antoine %item 195 1 %% [#]Crispy Bass",

    //Conditions: Has Cooking Recipe - Crispy Bass, Not Winter
    "Mail.SuperMeal": "Dear @, ^^ This one definitely gives you a lot of energy! I guess Kent really needed that before. ^ I'm glad he can finally start to relax some. ^  Sincerely, Antoine %item 195 1 %% [#]Super Meal",

    //Conditions: Has Cooking Recipe - Poi, Not Winter
    "Mail.Poi": "Dear @, ^^ Little Leo came up with this all by himself? It's sweeter than I expected. ^ He should be really proud! ^  Sincerely, Antoine %item 195 1 %% [#]Poi",

    //Conditions: Has Cooking Recipe - Mango Sticky Rice, Not Winter
    "Mail.MangoStickyRice": "Dear @, ^^ This was a lot more complex than I expected from Leo, but it sure tastes good! ^ I think mango might just be one of my favorite fruits these days. ^  Sincerely, Antoine %item 195 1 %% [#]Mango Sticky Rice",

    //Conditions: Has Cooking Recipe - Spaghetti, Not Winter
    "Mail.Spaghetti": "Dear @, ^^ I didn't know Lewis could make a spaghetti that didn't come out of a jar. Good for him! ^Making the noodles was kind of hard, but I think they turned out well. ^  Sincerely, Antoine %item 195 1 %% [#]Spaghetti",

    //Conditions: Has Cooking Recipe - Eggplant Parmesan, Not Winter
    "Mail.EggplantParmesan": "Dear @, ^^ So, I heard this was supposed to have cheese in it? With Lewis going to Marnie's Ranch all the time you'd think he'd have plenty of it. ^ I had to grow a large eggplant for this one, and Juliet wanted to take a bunch of pictures of it. She must have been so proud! ^  Sincerely, Antoine %item 195 1 %% [#]Eggplant Parmesan",

    //Conditions: Has Cooking Recipe - Sashimi, Not Winter
    "Mail.Sashimi": "Dear @, ^^ Raw fish is so good. Linus definitely knows what he's doing. ^ I managed to get these sliced extra thin. They're very delicate. ^  Sincerely, Antoine %item 195 1 %% [#]Sashimi",

    //Conditions: Has Cooking Recipe - Fish Taco, Not Winter
    "Mail.FishTaco": "Dear @, ^^ When I told Abigail I was eating a fish taco she started laughing. I don't really understand why. Linus did a good job with the recipe. ^  Sincerely, Antoine %item 195 1 %% [#]Fish Taco",



/*/ Food Commentary /*/ /*/


[Has Cooking Recipe - Pale Broth] "Marnie definitely … well she um … she really tried her best." "I tried my best too."

[Has Cooking Recipe - Rhubarb Pie] "Marnie makes an interesting pie! Putting rhubarb in it is really clever." "I think you'll like this one."

[Has Cooking Recipe - Miner's Treat] "You really wouldn't know there's cave carrots in it just by looking at it. Maybe this can be a sneaky way to get the kids to eat some vegetables." "Then again, the amount of sugar in it probably overrides any health benefits."

[Has Cooking Recipe - Cheese Cauliflower] "That cheese cauliflower recipe you sent mePam really likes putting cheese on things that would be pretty healthy otherwise." "Getting the cheese was a little difficult for me. So I hope it's good."

[Has Cooking Recipe - Stuffing] "This one actually smells really good. Did Pam adapt this from a TV dinner?" "Well I'd say she definitely improved it!"

[Has Cooking Recipe - Blueberry Tart] "This tart was very tasty. I'm surprised Pierre didn't make you pay for the recipe though." "You'll have to let me know if he gives you anymore freebies!"

[Has Cooking Recipe - Pumpkin Soup] "This soup is really nice, but sort of bland if you don't add more than just pumpkin and milk." "Robin definitely seems to like things bland, huh?"

[Has Cooking Recipe - Tom Kha Soup] "Oh! A recipe from Sandy! It's so interesting!" "It's pretty tasty too."

[Has Cooking Recipe - Pepper Poppers] "Peppers fried with cheese inside. That slides sound like the sort of spicy greasy thing Shane enjoys." "I heard he eats of lot of rich greasy foods for breakfast."

[Has Cooking Recipe - Strange Bun] "Uh. The recipe you sent me from Shane has … a unique ingredient. I almost didn't get my hands on it." "I'm sure they're just fine. I'll. Definitely try one later. After you."

[Has Cooking Recipe - Chowder] "Willy is such a good cook. He almost gives Gus a run for his money." "I like to add some potato to my chowder, but this was really nice as is."

[Has Cooking Recipe - Escargot] "Soak snails in some butter and you've got a tasty treat. Sort of. You have a buttery one anyway." "I wasn't sure if you were supposed to cook them with the shells on or not."

[Has Cooking Recipe - Fish Stew] "This stew is so hardy matey! Arrr!" "Um. Sorry. Was that a bit much?"


[Has Cooking Recipe - Hashbrowns (14 Spring, Year 2)] "You really can't miss when you fry a potato! The way the Queen of the Sauce does it is really interesting too!" "I got them extra golden for you."

[Has Cooking Recipe - Baked Fish (7 Summer, Year 1) ] "I saw a rerun of Queen of Sauce where she shared a baked fish recipe that I just had to try!" "I even caught the fish myself so it'd be extra fresh."

[Has Cooking Recipe - Complete Breakfast (21 Spring, Year 2)] "I finally caught a new Queen of the Sauce and she made a complete breakfast!. She's just amazing." "Everyone needs a complete breakfast. Especially you with all the work you do."

[Has Cooking Recipe - Lucky Lunch (28 Spring, Year 2)] "I'm feeling extra lucky today because I made the Queen of Sauce's Lucky Lunch!" "I hope you feel lucky today too!"

[Has Cooking Recipe - Tortilla (7 Fall, Year 1) ] "The second I saw you sent me this tortilla recipe I just had to hunt down the Queen of Sauce episode that it came from." "It definitely didn't disappoint!"

[Has Cooking Recipe - Pizza (7 Spring, Year 2)] "The Queen of Sauce made a whole pizza on her show! I usually don't care for a lot of cheese, but hers looked so good!" "I hope mine looks good too."

[Has Cooking Recipe - Pancakes (14 Summer, Year 1 - Rerun)] "Pancakes are so good! The recipe the Queen shared makes them so fluffy I just had to go outside right away and find a bunch of berries to eat with it." "Uh, I didn't really include the berries with yours. I sort of ate them all."

[Has Cooking Recipe - Carp Surprise (7 Summer, Year 2)] "Um, usually the Queen knocks it out of the park, but this one was actually a bit bland?" "I guess that was the surprise."

[Has Cooking Recipe - Glazed Yams (21 Fall, Year 1)] "Yams! The Queen used yams on her show! Aaah, I'm so happy! I love yams!" "The glaze makes them extra tasty too."

[Has Cooking Recipe - Fruit Salad (7 Fall, Year 2)] "This one is simple to make, but it's such a good use of summer fruits!" "The Queen of Sauce never ceases to amaze me."

[Has Cooking Recipe - Stir Fry (7 Spring, Year 1)] "The cave carrots really put this stir fry on a whole new level." "The Queen even had great tips on how to keep the rice fluffy!"

[Has Cooking Recipe - Plum Pudding (7 Winter, Year 1)] "The Queen really did make a classic seasonal treat, didn't she?" "I'm not sure why it only get eaten in the winter though. The plums aren't really that fresh by then."

[Has Cooking Recipe - Poppyseed Muffin (7 Winter, Year 2)] "Shane warned me that if I eat these I could get in trouble if I want to get a job." "It was a confusing conversation, but the muffins turned out tasty!"

[Has Cooking Recipe - Trout Soup (14 Fall, Year 1)] "I mean, you can't really blame the Queen for this one. Trout soup? What was bound to be pretty salty." "I don't mind the texture, but I heard it makes some people gag. So be careful!"

[Has Cooking Recipe - Blackberry Cobbler (14 Fall, Year 1)] "Aaah, the Queen made me so nostalgic with this recipe. A blackberry cobbler really is a slice of home for me." "I'd see the older ladies putting all kinds of different fruits in this. Peach was my absolute favorite."

[Has Cooking Recipe - Coleslaw (14 Spring, Year 1)] "This coleslaw is a lot lighter than what I saw back at home. The older ladies used way more mayonnaise." "I really like the Queen's version though. It's crisp."

[Has Cooking Recipe - Maple Bar (14 Summer, Year 2)] "Phew! I almost didn't manage to make this one. The Queen of Sauce makes it look so easy, but it's really not!" "I think my maple bar is a little chewier than it's supposed to be."

[Has Cooking Recipe - Chocolate Cake (14 Winter, Year 1)] "This recipe made so much cake! The Queen really likes to indulge for the holidays, huh?" "The chocolate made this extra rich, so maybe don't eat the whole thing at once like I've seen you do with other stuff."

[Has Cooking Recipe - Lobster Bisque (14 Winter, Year 2)] "Wow, it's crazy how the Queen's recipe for lobster bisque tastes just like Willy's." "I'm sure it's just a coincidence."

[Has Cooking Recipe - Crab Cakes (21 Fall, Year 2)] "Man, the smell of these crab cakes really brought me back. I used to see people frying these all the time." "Thanks to the Queen of Sauce I finally get to try some! And you do too!"

[Has Cooking Recipe - Radish Salad (21 Spring, Year 1)] "Radishes have an interesting sort of spiciness to them, don't they? It doesn't burn like a hot pepper does." "The vinegar really makes these shine though! The Queen is so smart."

[Has Cooking Recipe - Maki Roll (21 Summer, Year 1)] "I saw Gus selling this recipe at the saloon. I wonder if his tastes like the Queen's does?" "It's definitely my favorite way to eat fish!"

[Has Cooking Recipe - Pink Cake (21 Summer, Year 2)] "The Queen of Sauce made this cake look so cute! I tried to follow along, but I think I sort of botched it." "Oh well, it still tastes great!"

[Has Cooking Recipe - Pumpkin Pie (21 Winter, Year 1)] "This really feels like it'd be a great fall treat. The spices the Queen recommended takes this to a whole new level." "I'm actually pretty proud of this one."

[Has Cooking Recipe - Bruschetta (21 Winter, Year 2)] "Nothing is better than when bread gets crunchy and you can spread things on it. The Queen's roasted tomatoes are just great on it!" "You should pair this with a nice drink too."

[Has Cooking Recipe - Artichoke Dip (28 Fall, Year 1)] "I knew you could make a dip from onions, but artichokes? It's surprisingly tasty!" "The Queen said you should get this with chips for extra salt and crunch."

[Has Cooking Recipe - Fiddlehead Risotto (228 Fall, Year 2)] "Risotto is so hard! I wasted so much garlic just making it over and over again." "I really don't know how the Queen of Sauce managed to make hers so fast."

[Has Cooking Recipe - Bread (28 Summer, Year 1)] "I think my favorite thing to do with bread is make sandwiches. The Queen's bread is extra crusty too, I could eat it with just a little butter." "I'm interested in what you're going to do with yours!"

[Has Cooking Recipe - Roasted Hazelnuts (28 Summer, Year 2)] "This smelled so good. I almost ate them all before I could bring you some." "I tried to make you more, but they didn't last long."

[Has Cooking Recipe - Cranberry Candy (28 Winter, Year 1)] "Ha ha, I'm not really sure how I feel about cooking with apples. Watching the Queen of Sauce chopping them up and putting them in a blender…" "Anyway, it did a good job making a bitter fruit taste really sweet!"

[Has Cooking Recipe - Shrimp Cocktail (28 Winter, Year 2)] "Who knew that cocktail sauce was just tomatoes and horseradish? The Queen sure did!" "I like mine with extra horseradish, but I made yours normally."
/*/
    },
},